In [40]:
### GENDERCOUNT???###

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [41]:
# Dependencies and Setup
import pandas as pd

# File to Load 
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [42]:
purchase_data['SN'].nunique()

576

In [43]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [44]:
Number_of_unique_items = purchase_data['Item ID'].nunique()
Average_Price = purchase_data['Price'].mean()
Number_of_Purchases = purchase_data['Purchase ID'].nunique()
Total_Revenue = purchase_data['Price'].sum()

In [45]:
Purchasing_Analysis_dict = [{"Number of Unique Items": Number_of_unique_items, "Average Price": round(Average_Price, 2), "Number of Purchases": Number_of_Purchases, "Total Revenue": Total_Revenue}]
                

df_Purchasedata=pd.DataFrame(Purchasing_Analysis_dict)

df_Purchasedata['Average Price'] = df_Purchasedata['Average Price'].map("${:,.2f}".format)
df_Purchasedata['Total Revenue'] = df_Purchasedata['Total Revenue'].map("${:,.2f}".format)
df_Purchasedata

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

In [46]:
purchase_data['Gender'].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [82]:
purchase_data_drop = purchase_data_drop.sort_values("SN", inplace=False) 
purchase_data_drop.drop_duplicates(subset="SN", inplace=False)
purchase_data_drop

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
467,467,Adairialis76,16,Male,123,Twilight's Carver,2.28
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,4.48
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",4.91
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32
630,630,Aelaria33,23,Male,171,Scalpel,1.79
...,...,...,...,...,...,...,...
125,125,Yathecal82,20,Female,62,Piece Maker,1.87
595,595,Yathedeu43,22,Male,55,Vindictive Glass Edge,2.27
572,572,Yoishirrala98,17,Female,145,Fiery Glass Crusader,4.58
54,54,Zhisrisu83,10,Male,25,Hero Cane,4.35
560,560,Zontibe81,21,Male,2,Verdict,2.48

In [83]:
purchase_data_drop['Gender'].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [84]:


purchase_data_drop.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
467,467,Adairialis76,16,Male,123,Twilight's Carver,2.28
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,4.48
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",4.91
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32
630,630,Aelaria33,23,Male,171,Scalpel,1.79

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [85]:
purchase_data_drop['Gender'].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [86]:
purchase_data_drop['Gender'].value_counts(normalize=True)

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [87]:
gender_df = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/NA"],
    "Total Count": [484, 81, 11],
    "Percentage of Players": ["84.03%", "14.49%", "1.92%"]
})
gender_df

     Gender  Total Count Percentage of Players
0      Male          484                84.03%
1    Female           81                14.49%
2  Other/NA           11                 1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [94]:
purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [95]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [97]:
purchase_data.groupby(['Gender'])

In [98]:
# # Using GroupBy in order to separate the data into fields according to "state" values
purchase_data_grouped = purchase_data.groupby(['Gender'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(purchase_data_grouped)

# In order to be visualized, a data function must be used...
purchase_data_grouped.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x11e882850>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [124]:
Only_men = purchase_data.loc[purchase_data["Gender"] == "Male", :]
Only_men.count()

Purchase ID    652
SN             652
Age            652
Gender         652
Item ID        652
Item Name      652
Price          652
dtype: int64

In [105]:
Men_Average_Price = Only_men['Price'].mean()
print(round(Men_Average_Price, 2))

3.02

In [107]:
Men_Total_Purchase = Only_men['Price'].sum()
print(round(Men_Total_Purchase, 2))

1967.64

In [111]:
Average_Per_Man = Men_Total_Purchase / 484
print(round(Average_Per_Man,2))

4.07

In [112]:
Only_women = purchase_data.loc[purchase_data["Gender"] == "Female", :]
Only_women.count()

Purchase ID    113
SN             113
Age            113
Gender         113
Item ID        113
Item Name      113
Price          113
dtype: int64

In [113]:
Women_Average_Price = Only_women['Price'].mean()
print(round(Women_Average_Price, 2))

3.2

In [114]:
Women_Total_Purchase = Only_women['Price'].sum()
print(round(Women_Total_Purchase, 2))

361.94

In [116]:
Average_Per_Woman = Women_Total_Purchase / 81
print(round(Average_Per_Woman,2))

4.47

In [117]:
Only_other = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]
Only_other.count()

Purchase ID    15
SN             15
Age            15
Gender         15
Item ID        15
Item Name      15
Price          15
dtype: int64

In [118]:
Other_Average_Price = Only_other['Price'].mean()
print(round(Other_Average_Price, 2))

3.35

In [119]:
Other_Total_Purchase = Only_other['Price'].sum()
print(round(Other_Total_Purchase, 2))

50.19

In [121]:
Average_Per_Other = Other_Total_Purchase / 11
print(round(Average_Per_Other,2))

4.56

In [ ]:
Purchasing_Analysis_Df = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/NA"],
    "Purchase Count": [652, 113, 15],
    "Percentage of Players": ["84.03%", "14.49%", "1.92%"]
})
gender_df

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame